/*
Задача 2. Напишите программу, которая на вход
принимает два числа и выдает, какое число большее, 
а какое меньшее
*/
Console.Clear();

Console.Write("Input first number: ");
int number1  = Convert.ToInt32(Console.ReadLine());

Console.Write("Input second number: ");
int number2  = Convert.ToInt32(Console.ReadLine());

if(number1>number2) Console.Write("first number is maximus, second number is minimal.");
else Console.Write("first number is minimal, second number is maximus.");
/*
Задача 4. Напишите программк, которая принимает
на вход три числа и выдает максимальное из этих чисел
*/

/*
Задача 6. Напишите программу, которая на вход принимает
число и выдает, является ли данное число четным
(делится без остатка).
*/

/*
Задача 6. Напишите программу, которая на вход принимает 
число (N), а на выходе показывает все четные числа от 1 до N.

*/